import os
from zoneinfo import ZoneInfo

TIMEZONE = ZoneInfo("Europe/Moscow")

BOT_TOKEN = os.getenv("BOT_TOKEN", "")
ADMIN_ID = int(os.getenv("ADMIN_ID", 0))
MASTER_PHONE = os.getenv("MASTER_PHONE", "+7 (900) 123-45-67")

WORK_SLOTS = ["09:00-12:00", "12:00-15:00", "15:00-18:00"]
BLOCK_SYMBOL = "❌"

# Населенные пункты в радиусе ~50 км от пгт Кировское (Крым)
# Сначала самые близкие, затем остальные по алфавиту
ALLOWED_CITIES = [
    "пгт Кировское",
    "Владиславовка",
    "Новопокровка",
    "Журавки",
    "Синицыно",
    "Отважное",
    "Золотое поле",
    "Абрикосовка",
    "Добролюбовка",
    "Токарево",
    "Курское",
    "Старый Крым",
    "Первомайское",
    "Тимирязево",
    "Юркино",
    "Крестьяновка",
    "Водное",
    "Долинное",
    "Московское",
    "Трудолюбовка",
    "Изобильное",
    "Партизаны",
    "Калиновка",
    "Шубино",
    "Георгиевка",
    "Красновка",
    "Яркое Поле",
    "Льговское",
    "Семисотка",
    "Батальное",
    "Черняково",
    "Красносельское",
    "Новофедоровка",
    "Жемчужина",
    "Солнечная Долина",
    "Морское",
    "Веселое",
    "Грушевка",
    "Дачное",
    "Лесное",
    "Феодосия (в радиусе 50 км)",
    "Приморский",
    "Береговое",
    "Коктебель",
    "Щебетовка",
    "Курортное",
    "Наниково"
]